// pages/article/article.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    article : {
      title : '齐聚宝物与果实，为生命磁场注入富贵之气，慈恩天下天园介绍之富贵园（一）',
      date : '2020-08-20 10:20',
      read : '16,280',
      content : '<p>虽然目前烧纸祭祀仍很常见，但也有不少人表示，“烧纸就是一种寄托，还不如上网寄托，不住同一个城市的亲人，只要登录同一个祭祖祈福的平台，就可以共同祭拜一位亲人，完成共同的心愿；网上祭祖祈福可以弥补他们不能亲临墓地追思先人的遗憾，还能让他们有足够的空间写下对亲人的思念。”</p><p>与网页纪念堂相比，今年来兴起的类似“慈恩天下”一样，客户端登陆式的网络平台也赢得越来越多网友的青睐。《慈恩天下》中，用户可以创建【天园】，用以祭拜祈福。【天园】内有灵山秀水，也有亭台楼阁，花鸟虫鱼、彩云祥瑞都有极尽细致的描绘，是对现实世界的重现，甚至有人将其看作是逝者永存的另一个次元。美丽的山水楼阁，动人的视听感受，细腻的操作系统，规范的祭拜礼仪，其中蕴含的风水学原理和人生哲学，更是值得细细品味。</p><p>随着社会发展和人才流动的越加频繁，社会对于网络祈福的需求却在与日俱增。因此，网上祭祖祈福因其更方便、快捷、环保的特性，正逐渐受到越来越多的人们青睐。</p>'
    }
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    wx.setNavigationBarTitle({
      title: '慈恩堂'
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})